#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_cosmosdb_account.ngc will be created
  + resource "azurerm_cosmosdb_account" "ngc" {
      + connection_strings                = (sensitive value)
      + enable_automatic_failover         = false
      + enable_multiple_write_locations   = false
      + endpoint                          = (known after apply)
      + id                                = (known after apply)
      + is_virtual_network_filter_enabled = false
      + kind                              = "GlobalDocumentDB"
      + location                          = "northeurope"
      + name                              = "nextgenconf"
      + offer_type                        = "Standard"
      + primary_master_key                = (sensitive value)
      + primary_readonly_master_key       = (sensitive value)
      + read_endpoints                    = (known after apply)
      + resource_group_name               = "ngc"
      + secondary_master_key              = (sensitive value)
      + secondary_readonly_master_key     = (sensitive value)
      + tags                              = (known after apply)
      + write_endpoints                   = (known after apply)

      + consistency_policy {
          + consistency_level       = "BoundedStaleness"
          + max_interval_in_seconds = 10
          + max_staleness_prefix    = 200
        }

      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "westeurope"
        }
    }

  # azurerm_cosmosdb_mongo_collection.ngc will be created
  + resource "azurerm_cosmosdb_mongo_collection" "ngc" {
      + account_name        = "nextgenconf"
      + database_name       = "SessionsDb"
      + default_ttl_seconds = -1
      + id                  = (known after apply)
      + name                = "Sessions"
      + resource_group_name = "ngc"
      + shard_key           = "_id"
      + throughput          = 400
    }

  # azurerm_cosmosdb_mongo_database.ngc_sessions will be created
  + resource "azurerm_cosmosdb_mongo_database" "ngc_sessions" {
      + account_name        = "nextgenconf"
      + id                  = (known after apply)
      + name                = "SessionsDb"
      + resource_group_name = "ngc"
    }

  # github_repository.repository_api_gateway will be updated in-place
  ~ resource "github_repository" "repository_api_gateway" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for aggregating requests to storage services"
        etag               = "W/\"61336e8360942189ca3691e29e5ec8a2\""
        full_name          = "NextGenConf/ApiGateway"
        git_clone_url      = "git://github.com/NextGenConf/ApiGateway.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ApiGateway"
        http_clone_url     = "https://github.com/NextGenConf/ApiGateway.git"
        id                 = "ApiGateway"
        license_template   = "mit"
        name               = "ApiGateway"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ApiGateway.git"
        svn_url            = "https://github.com/NextGenConf/ApiGateway"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_service will be updated in-place
  ~ resource "github_repository" "repository_conference_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "Microservice for storing conferences"
        etag               = "W/\"bb5579839c20958c7d66bdc94a46cd13\""
        full_name          = "NextGenConf/ConferenceService"
        git_clone_url      = "git://github.com/NextGenConf/ConferenceService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ConferenceService"
        http_clone_url     = "https://github.com/NextGenConf/ConferenceService.git"
        id                 = "ConferenceService"
        name               = "ConferenceService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ConferenceService.git"
        svn_url            = "https://github.com/NextGenConf/ConferenceService"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_session_service will be updated in-place
  ~ resource "github_repository" "repository_conference_session_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing the relationship between conferences and sessions"
        etag               = "W/\"569fa1ce9225975d7a750dfb35e810a7\""
        full_name          = "NextGenConf/ConferenceSessionService"
        git_clone_url      = "git://github.com/NextGenConf/ConferenceSessionService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ConferenceSessionService"
        http_clone_url     = "https://github.com/NextGenConf/ConferenceSessionService.git"
        id                 = "ConferenceSessionService"
        license_template   = "mit"
        name               = "ConferenceSessionService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ConferenceSessionService.git"
        svn_url            = "https://github.com/NextGenConf/ConferenceSessionService"
      - topics             = [] -> null
    }

  # github_repository.repository_feed_service will be updated in-place
  ~ resource "github_repository" "repository_feed_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference feeds"
        etag               = "W/\"f0594a1290b0eae0deb1e5e9b8425780\""
        full_name          = "NextGenConf/FeedService"
        git_clone_url      = "git://github.com/NextGenConf/FeedService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/FeedService"
        http_clone_url     = "https://github.com/NextGenConf/FeedService.git"
        id                 = "FeedService"
        license_template   = "mit"
        name               = "FeedService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/FeedService.git"
        svn_url            = "https://github.com/NextGenConf/FeedService"
      - topics             = [] -> null
    }

  # github_repository.repository_k8s_config will be updated in-place
  ~ resource "github_repository" "repository_k8s_config" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Repository containing the kubernetes resource files for the NextGenConf cluster"
        etag               = "W/\"7bf201ce22ba4ab871cc66dcdd2ce9b0\""
        full_name          = "NextGenConf/KubeConfig"
        git_clone_url      = "git://github.com/NextGenConf/KubeConfig.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/KubeConfig"
        http_clone_url     = "https://github.com/NextGenConf/KubeConfig.git"
        id                 = "KubeConfig"
        license_template   = "mit"
        name               = "KubeConfig"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/KubeConfig.git"
        svn_url            = "https://github.com/NextGenConf/KubeConfig"
    }

  # github_repository.repository_session_service will be updated in-place
  ~ resource "github_repository" "repository_session_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference sessions"
        etag               = "W/\"a9d7719b485f4308e09ab1a193ae8624\""
        full_name          = "NextGenConf/SessionService"
        git_clone_url      = "git://github.com/NextGenConf/SessionService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/SessionService"
        http_clone_url     = "https://github.com/NextGenConf/SessionService.git"
        id                 = "SessionService"
        license_template   = "mit"
        name               = "SessionService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/SessionService.git"
        svn_url            = "https://github.com/NextGenConf/SessionService"
      - topics             = [] -> null
    }

  # github_repository.repository_web_app will be updated in-place
  ~ resource "github_repository" "repository_web_app" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "React app displaying conferences"
        etag               = "W/\"9228efbfdeb772b95dc6e5fc52c0bd2f\""
        full_name          = "NextGenConf/WebApp"
        git_clone_url      = "git://github.com/NextGenConf/WebApp.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/WebApp"
        http_clone_url     = "https://github.com/NextGenConf/WebApp.git"
        id                 = "WebApp"
        name               = "WebApp"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/WebApp.git"
        svn_url            = "https://github.com/NextGenConf/WebApp"
      - topics             = [] -> null
    }

Plan: 3 to add, 7 to change, 0 to destroy.
```

</details>

*Workflow: `ci pr`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
